labis7/AVR---ATmega16---STK500/M1/M1/src/main.c
							//Now,its gonna find a valid path(which will get colorized accordingly)
							while((u != (ibar+istep))&&(z != (ybar+ystep))) 
							{
								if(M[u*8 + z] == !MyColor ) //Break, because we need empty slot(to put our move in it)
								{
									break;
								}
								
								if( M[u*8 + z] == 2){			//We found a valid empty slot
									skip = 0;
									move_done=1;
									//CheckMove(u, z, MyColor, 1);  //Coloring adjacent paths, according to the rules  ////////-- OLD VERSION --////////////
									checkmove_sim(u, z, !MyColor, 0); //Calculate and 'write'(if its the greatest till now) on board(in the specific slot we found) the result score of this possible move.
									break;
								}

								z+= ystep;
								u+= istep;
							}
							
						}//if check neighbors
					}//j for

				}//i for
			}//if  (find our pawn)

		}//for my

	}//for mi

	if(move_done)
	{
		return;
	}
	else
		v_max=0; 
	return;


	
}


uint8_t checkmove_sim(uint8_t mi,uint8_t my,uint8_t color, uint8_t paint)
{
	volatile int i,j;
	uint8_t u,z,found,ibar,ybar,skip,istep,ystep, pcounter;
	char mymove[6];
	pcounter=0;
	
	found = 0;//init before main loop
	for(i = mi - 1; i<=(mi+1); ++i)
	{
		if(i<0||i>7)
		continue;
		for(j = my - 1; j<=(my+1); ++j)
		{
			if(j<0||j>7)
			continue;
			//checking neighbors, we are trying to find opponents color
			if((M[i*8 + j] == color)||(M[i*8 + j] >= 2))
			;
			else //opponents color was found
			{
				//Setting up i barrier
				if(i > mi)
				ibar = 7 ;
				else if(i == mi)
				ibar = 9;
				else
				ibar = 0;
				
				//Setting up y barrier
				if(j > mi)
				ybar = 7;
				else if(j == my)
				ybar = 9;
				else
				ybar = 0;

				//setting up steps, (for the loops)
				istep = i - mi;
				ystep = j - my;
				//start from the accepted neighbor
				u=i;
				z=j;

				skip = 1;
				//Now,its gonna find a valid path(which will get colorized accordingly)
				
				
				if(paint == 0) //just for finding the best slot
				{
					while((u != (ibar+istep))&&(z != (ybar+ystep)))
					{
						//check
						if( M[u*8 + z] >= 2)
						break;
						
						//IF in the line we are checking, we find a friendly pawn, then the move is legal so place the new pawn
						if(M[u*8 + z] == color )
						{
							
							//M[mi*8 + my] = color;
							
							//mark that it is a legal move
							found = 1;
							skip = 0;
							break;
						}
						z+= ystep;
						u+= istep;
						
					}
					
					if(!skip) //if a solution is found
					{
						u=i;
						z=j;
						while((u!=ibar)&&(z!=ybar))//barriers will never get reached.
						{
							if((M[u*8 + z] >= 2)||(M[u*8 + z] == color ))
							break;

							//M[u*8 + z] = color;
							pcounter++;
							z+= ystep;
							u+= istep;
						}
					}

				}
				else
				{
					while((u != (ibar+istep))&&(z != (ybar+ystep)))
					{
						//check
						if( M[u*8 + z] >= 2)
						break;
						
						//IF in the line we are checking, we find a friendly pawn, then the move is legal so place the new pawn
						if(M[u*8 + z] == color )
						{
							
							M[mi*8 + my] = color;
							
							//mark that it is a legal move
							found = 1;
							skip = 0;
							break;
						}
						z+= ystep;
						u+= istep;
						
					}
					
					if(!skip) //if a solution is found
					{
						u=i;
						z=j;
						while((u!=ibar)&&(z!=ybar))//barriers will never get reached.
						{
							if((M[u*8 + z] >= 2)||(M[u*8 + z] == color ))
							break;

							M[u*8 + z] = color;
							z+= ystep;
							u+= istep;
						}
					}
				}//if paint
				
			}//if check
		}	  //y for
	}	  //x for
	if(paint == 0)
	{
		if(M[vi_max*8 + vj_max] <= pcounter +14 + V[mi*8 +my]) //14: OFFSET FOR OUR VALUE TABLE
		{
			M[mi*8 + my] = pcounter +14 + V[mi*8 +my];   //remember on our board the latest max move.(there is no reason to save a value on board if its not the max)
			if(M[vi_max*8 + vj_max] > 2)
				M[vi_max*8 + vj_max] = 2;
			vi_max = mi;
			vj_max = my;
			v_max = pcounter +14 + V[mi*8 +my];
		}
	}

	if(found == 1)
	return 1;//Legal
	return 0;
}



simulate_opponent()
{
	
	uint8_t worst_op_move_value;
	if( v1_max > 0 )
	{
		memcpy(MB, M , 64*8);
		checkmove_sim(vi1_max, vj1_max, MyColor, 1);   // we make 1 of our best 3 possible moves
		algo_sim();                              //finding the best possible solution(without speculation)
		vi_final = vi1_max;
		vj_final = vj1_max;
		worst_op_move_value = v_max;

	}
	if( v1_max > 0 )
	{
		memcpy(M, MB , 64*8);
		checkmove_sim(vi2_max, vj2_max, MyColor, 1);   // we make 1 of our best 3 possible moves
		algo_sim();                              //finding the best possible solution(without speculation)
		if(worst_op_move_value > v_max)
		{
			vi_final = vi2_max;
			vj_final = vj2_max;
			worst_op_move_value = v_max;
		}
	}
	if( v1_max > 0 )
	{
		memcpy(M, MB , 64*8);
		checkmove_sim(vi3_max, vj3_max, MyColor, 1);   // we make 1 of our best 3 possible moves
		algo_sim();                              //finding the best possible solution(without speculation)
		if(worst_op_move_value > v_max)
		{
			vi_final = vi3_max;
			vj_final = vj3_max;
			worst_op_move_value = v_max;
		}
	}
	memcpy(M, MB , 64*8);
}



///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////
///////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////



//////////////////////////////////////////////////////////////////////////// ALGORITHM   /////////////////////////////////////////////////////////////////////////////
void Algo(void)
{
	uint8_t mi,my,i,j,u,z,ibar,ybar,skip,istep,ystep;
	myTurn = 1;		//Important - collision with  init_timer
	
	v1_max = 0;
	v2_max = 0;
	v3_max = 0;


	char mymove[6];
	
	//The next 2 for loop are responsible to find(scanning whole board) our pawns  ----------------------------------------- U P D A T E : we will save the positions of our pawns
	for(mi=0;mi<=7;mi++)
	{
		for(my=0; my<=7; my++)
		{
			 // we found one of our pawns, so we start to check potential move 
			if(M[mi*8+my] == MyColor)  
			{					
				//The next 2 for loops find scanning the 8 slots/positions around the pawn we found.
				for(i = mi - 1; i<=(mi+1); ++i)
				{
					if(i<0||i>7) //Matrix out of border protection 
						continue;
					for(j = my - 1; j<=(my+1); ++j)
					{
						if(j<0||j>7) //Matrix out of border protection 
							continue;

						//our pawn has en enemy pawn adjacent to it,
						//so we will find the borders+direction we need to search
						if((M[i*8 + j] == !MyColor))		
						{

							//Setting up i barrier (board)
							if(i > mi)
							ibar = 7 ;
							else if(i == mi)
							ibar = 10;   //big enough, so the other axis will break while below
							else
							ibar = 0;
							
							//Setting up y barrier
							if(j > mi)
							ybar = 7;
							else if(j == my)
							ybar = 10;
							else
							ybar = 0;

							//setting up steps, (for the loops)
							istep = i - mi;
							ystep = j - my;
							
							//start from the accepted neighbor
							u=i;
							z=j;
							


							skip = 1;//reset

