labis7/AVR---ATmega16---STK500/M1/M1/src/main.c
							//Now,its gonna find a valid path(which will get colorized accordingly)
							while((u != (ibar+istep))&&(z != (ybar+ystep))) 
							{
								if(M[u*8 + z] == MyColor ) //Break, because we need empty slot(to put our move in it)
								{
									break;
								}
								
								if( M[u*8 + z] == 2){			//We found a valid empty slot
									skip = 0;
									move_done=1;
									//CheckMove(u, z, MyColor, 1);  //Coloring adjacent paths, according to the rules  ////////-- OLD VERSION --////////////
									CheckMove(u, z, MyColor, 0); //Calculate and 'write'(if its the greatest till now) on board(in the specific slot we found) the result score of this possible move.
									/*
									//Building message
									mymove[0] = 'M';
									mymove[1] = 'M';
									mymove[2] = '\x20';
									mymove[3] = u+65;
									mymove[4] = (z+1)+'0';
									mymove[5] = '\r';
									*/
									break;
								}

								z+= ystep;
								u+= istep;
							}
							//if a solution is found
							/*
							if(!skip) 
							{
								u=i;
								z=j;
								//Same iteration, this time we color the path
								while((u!=ibar)&&(z!=ybar))//barriers will never get reached.
								{
									if(M[u*8 + z] == MyColor )
										break;
									M[u*8 + z] = MyColor;
									
									z+= ystep;
									u+= istep;
								}
								
								move_done=1;
								Board(); //Board Visualization
								Transmit(mymove,0,6); //Transmit our Move
								if(move_done)
									break;
							}
							*/
							
						}//if check neighbors
					}//j for

				}//i for
			}//if  (find our pawn)

		}//for my

	}//for mi
	if(move_done)
	{
		
		simulate_opponent();


		//vi_final and vj_final are the final move decision after the speculation 
		
		CheckMove(vi_final, vj_final, MyColor ,1); // Paint the best possible slot
		mymove[0] = 'M';
		mymove[1] = 'M';
		mymove[2] = '\x20';
		mymove[3] = vi_final+65;
		mymove[4] = (vj_final+1)+'0';
		mymove[5] = '\r';
		Board();
		Transmit(mymove,0,6); //Transmit our Move
		
	}

	


	
	//if move_done == 0 , that means that we cant find solution, we pass                           
	//while loop until 'OK' response
	while(1)
	{		// Check_Input does not support "OK" response so we check it here
		if(move_done >= 1)
		{
			while(1)
			{
				_delay_ms(10);
				if((move_done == 2)||(myTurn==2))  //myturn==2 means that a RST was made. and we can break this loop.
				{ // we received the response we were waiting'
					move_done = 0;
					break;
				}
			}
			
			if(myrxbuffer[rxReadPos] == 79 && myrxbuffer[rxReadPos+1] == 75) //Respone ok for our MM
			{
				init_timer();
				rxReadPos=rxWritePos;
				myTurn = 0;
				break;
			}

		}
		else if(move_done == 0)//No solution was found
		{
			if (enemy_pass == 1) //Enemy sent pass too
			{
				EndGame();		//Go count pawns and announce the winner
				break;
			}
			else
			{
				Transmit("MP\r",0,strlen("MP\r")); //Transmit MYPASS
				break;
			}
		}
	}
	
}
//////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////////





/////////////////////////////////////////////////////////////////////////////  CHECK MOVE  /////////////////////////////////////////////////////////////////////
//Similar to Algo (less comments)
//Given a slot, it can find all the possible paths that must be colorized(It also returns Legal/Illegal flag)

uint8_t CheckMove(uint8_t mi,uint8_t my,uint8_t color, uint8_t paint)
{
	volatile int i,j;
	uint8_t u,z,found,ibar,ybar,skip,istep,ystep, pcounter;
	char mymove[6];
	pcounter=0;
	
	found = 0;//init before main loop
	for(i = mi - 1; i<=(mi+1); ++i)
	{
		if(i<0||i>7)
			continue;
	  for(j = my - 1; j<=(my+1); ++j)		
	  {
		if(j<0||j>7)
			continue;  
		//checking neighbors, we are trying to find opponents color
	    if((M[i*8 + j] == color)||(M[i*8 + j] >= 2)) 
			;
		else //opponents color was found
		{	
			//Setting up i barrier
			if(i > mi)
				ibar = 7 ;
			else if(i == mi)
				ibar = 9;
			else
				ibar = 0;
			
			//Setting up y barrier
			if(j > mi)
			ybar = 7;
			else if(j == my)
			ybar = 9;
			else
			ybar = 0;	

			//setting up steps, (for the loops)
			istep = i - mi; 
			ystep = j - my;
			//start from the accepted neighbor
			u=i; 
			z=j;

			skip = 1;
			//Now,its gonna find a valid path(which will get colorized accordingly)
			
			
			if(paint == 0) //just for finding the best slot
			{
				while((u != (ibar+istep))&&(z != (ybar+ystep)))
				{
					//check
					if( M[u*8 + z] >= 2)
					break;
					
					//IF in the line we are checking, we find a friendly pawn, then the move is legal so place the new pawn
					if(M[u*8 + z] == color )
					{
						
						//M[mi*8 + my] = color;
						
						//mark that it is a legal move
						found = 1;
						skip = 0;
						break;
					}
					z+= ystep;
					u+= istep;
					
				}
				
				if(!skip) //if a solution is found
				{
					u=i;
					z=j;
					while((u!=ibar)&&(z!=ybar))//barriers will never get reached.
					{
						if((M[u*8 + z] >= 2)||(M[u*8 + z] == color ))
						break;

						//M[u*8 + z] = color;
						pcounter++;
						z+= ystep;
						u+= istep;
					}
				}

			}
			else
			{
				while((u != (ibar+istep))&&(z != (ybar+ystep)))
				{
					//check	
					if( M[u*8 + z] >= 2)
						break;
					
					//IF in the line we are checking, we find a friendly pawn, then the move is legal so place the new pawn 
					if(M[u*8 + z] == color )	
					{ 
					
						M[mi*8 + my] = color;
														
						//mark that it is a legal move
						found = 1;
						skip = 0;
						break;
					}
	    			z+= ystep;
					u+= istep;
			
				}			
			
				if(!skip) //if a solution is found
				{
					u=i;
					z=j;
					while((u!=ibar)&&(z!=ybar))//barriers will never get reached.
					{
						if((M[u*8 + z] >= 2)||(M[u*8 + z] == color ))
							break;

						M[u*8 + z] = color;										
						z+= ystep;
						u+= istep;
					}
				}
			}//if paint
			
         }//if check
	  }	  //y for	
	}	  //x for
	if(paint == 0)
	{
		
		if(v1_max < pcounter + 14 + V[mi*8 +my])
		{
			v1_max  = pcounter + 14 + V[mi*8 +my];
			vi1_max = mi;
			vj1_max  = my;

			v2_max  =   v1_max 	;
			vi2_max = 	vi1_max	;
			vj2_max  =	vj1_max	;

			v3_max  =   v2_max 	;
			vi3_max = 	vi2_max	;
			vj3_max  =	vj2_max	;
		}
		else if ( v2_max < pcounter + 14 + V[mi*8 +my]  )
		{
			v2_max  = pcounter + 14 + V[mi*8 +my];
			vi2_max = mi;
			vj2_max  = my;

			v3_max  =   v2_max 	;
			vi3_max = 	vi2_max	;
			vj3_max  =	vj2_max	;
		}
		else if ( v3_max < pcounter + 14 + V[mi*8 +my]  )
		{
			v3_max  = pcounter + 14 + V[mi*8 +my];
			vi3_max = mi;
			vj3_max  = my;
		}

